<?php
//--------------------------------------------------------------------------------------------------
// Bottom Top
//--------------------------------------------------------------------------------------------------
//
// Sistemin en alt katmanının bir üstünde çalıştırılmak istenen kodlar yazılır.
// Çekirdek bişinin başında devreye girer..
//
// Konum
//
// Çekirdek çalışmasından sonra, Çekirdek bitişinden önce
// 
//--------------------------------------------------------------------------------------------------
