<?php 
namespace ZN\DataTypes;

interface SeparatorInterface
{
	//----------------------------------------------------------------------------------------------------
	//
	// Yazar      : Ozan UYKUN <ozanbote@windowslive.com> | <ozanbote@gmail.com>
	// Site       : www.zntr.net
	// Lisans     : The MIT License
	// Telif Hakkı: Copyright (c) 2012-2016, zntr.net
	//
	//----------------------------------------------------------------------------------------------------
	
	//----------------------------------------------------------------------------------------------------
	// Encode
	//----------------------------------------------------------------------------------------------------
	// 
	// @param array  $data
	// @param string $key
	// @param string $separator
	//
	//----------------------------------------------------------------------------------------------------
	public function encode(Array $data, String $key = NULL, String $separator = NULL) : String;
	
	//----------------------------------------------------------------------------------------------------
	// Decode
	//----------------------------------------------------------------------------------------------------
	// 
	// @param string $word
	// @param string $key
	// @param string $separator
	//
	//----------------------------------------------------------------------------------------------------
	public function decode(String $word, String $key = NULL, String $separator = NULL) : \stdClass;

	//----------------------------------------------------------------------------------------------------
	// Decode Array
	//----------------------------------------------------------------------------------------------------
	// 
	// @param string $word
	// @param string $key
	// @param string $separator
	//
	//----------------------------------------------------------------------------------------------------
	public function decodeArray(String $word, String $key = NULL, String $separator = NULL) : Array;
}