<?php
//--------------------------------------------------------------------------------------------------
// Middle
//--------------------------------------------------------------------------------------------------
//
// Sistemin orta katmanında çalıştırılmak istenen kodlar yazılır.
// Çekirdek başlangıcından sonra devreye girer..
//
// Konum
//
// Çekirdek başlangıcından sonra, Çekirdek çalışmasından önce
// 
//--------------------------------------------------------------------------------------------------
