<?php
//--------------------------------------------------------------------------------------------------
// Middle Top
//--------------------------------------------------------------------------------------------------
//
// Sistemin orta katmanının bir üstünde çalıştırılmak istenen kodlar yazılır.,
// Çekirdek kodlarının başında çalıştırılır.
//
// Konum
//
// Çekirdek başlangıcından önce
// 
//--------------------------------------------------------------------------------------------------
