<?php

/************************************************************/
/*                       SYSTEM HIERARCHY                   */
/************************************************************/
/*
/* Yazar: Ozan UYKUN <ozanbote@windowslive.com> | <ozanbote@gmail.com>
/* Site: www.zntr.net
/* Lisans: The MIT License
/* Telif Hakkı: Copyright (c) 2012-2015, zntr.net
*/
Hierarchy::run();
/******************************************************************************************
* HIEARCHY CLASS                                                                          *
*******************************************************************************************
| Dahil(Import) Edilirken : Dahil edilmeye ihtiyaç duymaz.     							  |
| Sınıfı Kullanırken      :	Sistem kullanır.										      |
| 																						  |
| Genel Kullanım:																          |
| Oluşturulan çekirdek yapılarının belli bir sıra ile dahil edilmesi için kullanılmıştır. |
|																						  |
******************************************************************************************/	
class Hierarchy
{
	// Hiyerarşi sınıfı çalıştırma yöntemi
	public static function run()
	{ 
		/******************************************************************************************
		* Sabitler dahil ediliyor.                                                                *
		******************************************************************************************/
		require_once 'System/Core/ZN.php'; 
		
		/******************************************************************************************
		* Sabitler dahil ediliyor.                                                                *
		******************************************************************************************/
		require_once 'System/Core/Constants.php'; 
		
		/******************************************************************************************
		* Config sınıfı dahil ediliyor.                                                       	  *
		******************************************************************************************/
		require_once 'System/Core/Config.php';	
		
		/******************************************************************************************
		* Autoloader sınıfı dahil ediliyor.                                                       *
		******************************************************************************************/
		require_once 'System/Core/Autoloader.php';	
	
		/******************************************************************************************
		* Fonksiyonlar dahil ediliyor.                                                            *
		******************************************************************************************/
		require_once 'System/Core/Functions.php'; 
		
		/******************************************************************************************
		* Başlangıçta çalıştırılması isenen yöntemler çalıştırılıyor.                             *
		******************************************************************************************/
		require_once 'System/Core/Starting.php'; 	
	
		/******************************************************************************************
		* ZN Temel yapısı dahil ediliyor.                             							  *
		******************************************************************************************/
		require_once 'System/Core/Structure.php'; 	
	}
}