<?php
interface DateInterface
{
	//----------------------------------------------------------------------------------------------------
	//
	// Yazar      : Ozan UYKUN <ozanbote@windowslive.com> | <ozanbote@gmail.com>
	// Site       : www.zntr.net
	// Lisans     : The MIT License
	// Telif Hakkı: Copyright (c) 2012-2016, zntr.net
	//
	//----------------------------------------------------------------------------------------------------
	
	//----------------------------------------------------------------------------------------------------
	// Convert
	//----------------------------------------------------------------------------------------------------
	// 
	// Tarih bilgisini dönüştürmek için kullanılır.
	//
	// @param  string $date
	// @param  string $format
	// @return string 
	//
	//----------------------------------------------------------------------------------------------------
	public function convert($date, $format);
}