<?php
//----------------------------------------------------------------------------------------------------
// SUCCESS
//----------------------------------------------------------------------------------------------------
//
// Yazar      : Ozan UYKUN <ozanbote@windowslive.com> | <ozanbote@gmail.com>
// Site       : www.zntr.net
// Lisans     : The MIT License
// Telif Hakkı: Copyright (c) 2012-2016, zntr.net
//
//----------------------------------------------------------------------------------------------------
$lang['Success']['success'] = 'İşlem başarı ile tamamlandı.';