<?php
/************************************************************/
/*                 LIBRARIES(KÜTÜPHANELER)                  */
/************************************************************/
/*
*/
//-------------------------------------------------------------------------------------
// İşlev: Css3 kütüphanesi ile ilgili gerekli ayarları içerir.
// Aşağıda css3 komutlarının uygulanacağı tarayıcı listesi mevcuttur.
//-------------------------------------------------------------------------------------
$config['Css3']['browsers'] = array("","-o-","-ms-","-moz-","-webkit-");