<?php
//----------------------------------------------------------------------------------------------------
// INI 
//----------------------------------------------------------------------------------------------------
//
// Author     : Ozan UYKUN <ozanbote@windowslive.com> | <ozanbote@gmail.com>
// Site       : www.znframework.com
// License    : The MIT License
// Copyright  : Copyright (c) 2012-2016, ZN Framework
//
//----------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------
// Set Htaccess File
//----------------------------------------------------------------------------------------------------
//
// Genel Kullanım: ini_set() yöntemiyle yapamadığınız ayarlamaları buradan yapabilirsiniz. 
// .htaccess dosyasında ini ayarları yapılabilsin mi?   									  
//
//----------------------------------------------------------------------------------------------------
$config['Ini']['setHtaccessFile'] = false;

//----------------------------------------------------------------------------------------------------
// Settings
//----------------------------------------------------------------------------------------------------
//
// Genel Kullanım: .htaccess üzerinden hangi ini ayarlarını yapacaksanız onları 			  
// yazıyorsunuz. Anahtar kelime => değeri												  
// Örnek: upload_max_filesize => "10M" 						      						  
//
//----------------------------------------------------------------------------------------------------
$config['Ini']['settings'] = array();